Repository: nicklambson/bitcoin-multilingual
Catalog: alignments/bitcoin-is-time/Bitcoin is Time_es.tmx
Source language: en_us
Languages: es

source: Causality is also the reason why cryptographic hash functions are so crucial when it comes to timestamping documents in cyberspace:
es: La causalidad es también la razón por la que las funciones hash criptográficas son tan cruciales cuando se trata de sellar documentos en el ciberespacio:

source: they introduce a causal relationship.
es: introducen una relación causal.

source: Since it is practically impossible to create a valid cryptographic hash without having the document in the first place, a causal relationship between the document and the hash is introduced:
es: Como es prácticamente imposible crear un hash criptográficamente válido sin tener el documento en el primer lugar, una relación causal entre el documento y el hash es introducida:

source: the data in question existed first, the hash was generated later.
es: el dato en cuestión existió primero, y el hash fue generado después.

source: In other words:
es: En otras palabras:

source: without the computational irreversibility of one-way functions, there would be no causality in cyberspace.
es: sin la irreversibilidad computacional de las funciones unidireccionales, no habría causalidad en el ciberespacio.

source: A before B
es: algoritmo de hash A antes que B

source: With this causal building block in place, one can come up with schemes that create a chain of events, causally linking A to B to C and so on.
es: Con este bloque de construcción causal en su lugar, uno puede idear esquemas que creen una cadena de eventos, vinculando causalmente A con B a C y así sucesivamente.

source: In that sense, secure digital timestamping moves us from a timeless place in the ether into the realm of digital history.
es: En ese sentido, la marca de tiempo segura digital nos traslada desde un lugar atemporal en el éter hacia el ámbito de la historia digital.

source: Causality fixes events in time.
es: “La causalidad arregla los eventos en el tiempo.

source: If an event was determined by certain earlier events, and determines certain subsequent events, then the event is sandwiched securely into its place in history.
es: Si un evento fue determinado por ciertos eventos previos, y determina ciertos eventos subsiguientes, entonces el evento se coloca de forma segura en su lugar de la historia.”

source: It goes without saying that causality is of the utmost importance when it comes to economic calculations.
es: No hace falta decir que la causalidad es de suma importancia cuando se trata de cálculos económicos.

source: And since a ledger is nothing but the embodiment of economic calculations of multiple cooperating participants, causality is essential for every ledger.
es: Y dado que un libro contable no es más que la encarnación de los cálculos económicos de múltiples participantes que cooperan, la causalidad es esencial para cada libro contable.

source: We need a system for participants to agree on a single history […].
es: "Necesitamos un sistema en el que los participantes estén de acuerdo en una única historia [...].

source: The solution we propose begins with a timestamp server.
es: La solución que proponemos empieza con un servidor de marca de tiempo.”

source: It is fascinating that all of the puzzle pieces that make Bitcoin work did already exist.
es: Es fascinante que todas las piezas de rompecabezas que hacen que Bitcoin funcione ya existían.

source: As early as 1991, Haber and Stornetta introduced two schemes that make it “difficult or impossible to produce false time-stamps.”
es: Tan pronto como en 1991, Haber y Stornetta introdujeron dos esquemas que hacen “difícil o imposible producir marcas de tiempo falsas”.

source: The first relies on a trusted third party; the second, more elaborate “distributed trust” scheme, does not.
es: El primero se basa en un tercero de confianza; el segundo esquema, más elaborado, de “confianza distribuida”, no depende de un tercero de confianza.

source: The authors even identified the inherent problems of trusting a causal chain of events and what would be required to rewrite history.
es: Los autores incluso identificaron los problemas inherentes de confiar en una cadena causal de eventos y qué se requeriría para reescribir la historia.

source: In their words, “the only possible spoof is to prepare a fake chain of time-stamps, long enough to exhaust the most suspicious challenger that one anticipates.”
es: En sus propias palabras “la única trampa posible es preparar una cadena falsa de marcas de tiempo, lo suficientemente larga para agotar al que tenga más sospechas”.

source: A similar attack vector exists in Bitcoin today, in the form of a 51% attack (more on that in a later chapter).
es: Un vector similar de ataque existe actualmente en Bitcoin, en la forma de un ataque del 51% (más sobre esto en un capítulo posterior).

source: One year later, Bayer, Haber, and Stornetta built upon their previous work and proposed to use trees instead of simple linked lists to tie events together.
es: Un año después, Bayer, Haber y Stornetta revisaron su trabajo previo y propusieron usar árboles en lugar de simples listas ligantes para unir eventos.

source: What we know as Merkle Trees today are simply efficient data structures to create a hash from multiple hashes deterministically.
es: Lo que conocemos como los Árboles de Merckle hoy en día son simples estructuras eficientes de datos para crear un hash a partir de múltiples hashes de forma determinística.

source: For timestamping, this means that you can efficiently bundle multiple events into one “tick.”
es: Para la marca de tiempo, esto significa que puedes agrupar de forma eficiente múltiples eventos dentro de un mismo “tick”.

source: In the same paper, the authors propose that the distributed trust model introduced in 1991 could be improved by carrying out a recurring “world championship tournament” to determine a single “winner” who widely publishes the resulting hash somewhere public, like a newspaper.
es: En el mismo paper, los autores propusieron que el modelo de confianza distribuida introducida en 1991 podía ser mejorado hacia un “torneo de campeones mundiales” recurrente para determinar un único “ganador” quien ampliamente publique el hash resultante en un lugar público, como un periódico.

source: Sounds familiar?
es: ¿Suena familiar?

source: As we shall see, it turns out that newspapers are also an excellent way to think about the second ingredient of time:
es: Como ya veremos, resulta que los periódicos también son una forma excelente para pensar sobre el segundo ingrediente del tiempo:

source: unpredictability.
es: la impredecibilidad.

source: Causality and Unpredictability
es: Causalidad y impredecibilidad

source: Time is not a reality [hupostasis], but a concept [noêma] or a measure [metron]…
es: El tiempo no es una realidad, es un concepto o una medida…

source: Antiphon the Sophist, On Truth (3rd century AD)
es: Antifon el Sofista, En Verdad (Año 300)

source: While causality is essential, it is not sufficient.
es: La causalidad es esencial, pero no suficiente.

source: We also need unpredictability for time to flow.
es: También necesitamos de impredecibilidad para que el tiempo fluya.

source: In the physical realm, we observe natural processes to describe the flow of time.
es: En el mundo físico, observamos el proceso natural para describir el flujo del tiempo.

source: We observe a general increase in entropy and call that the arrow of time.
es: Observamos un incremento general de la entropía y a eso le llamamos la flecha del tiempo.

source: Even though the laws of nature seem to be oblivious in regards to the direction of this arrow in most cases, certain things can’t be undone, practically speaking.
es: Aunque las leyes de la naturaleza parezcan obvias respecto de la dirección de esta flecha en la mayoría de los casos, algunas cosas no se pueden deshacer, hablando en forma práctica.

source: You can’t unscramble an egg, as they say.
es: No puedes des-romper un huevo.

source: Similarly, entropy-increasing functions are required to establish an arrow of time in the digital realm.
es: Similarmente, las funciones que incrementan la entropía son requeridas para establecer una flecha del tiempo en el mundo digital.

source: Just like it is practically impossible to unscramble an egg, it is practically impossible to unscramble a SHA256 hash or cryptographic signature.
es: Así como es prácticamente imposible des-romper un huevo, es prácticamente imposible des-romper un hash SHA256 o una firma criptográfica.

source: Without this increase in entropy, we could go forward and backward in time willy-nilly.
es: Sin este incremento de la entropía, podríamos ir hacia adelante y atrás en el tiempo a gusto y piacere.

source: The sequence of Fibonacci Numbers, for example, is causal but not entropic.
es: La secuencia de números de Fibonacci, por ejemplo, es causal pero no entrópica.

source: Every number in the sequence is caused by the two numbers that came before it.
es: Cada número en la secuencia es causado por los dos números anteriores.

source: In that sense, it is a causal chain.
es: En ese sentido, es una cadena causal.

source: However, it is not useful to tell the time because it is entirely predictable.
es: No obstante, no es útil para decir la hora porque es completamente predecible.

source: In the same way that a kidnapper can’t simply stand in front of a calendar that shows the current date, we can’t use predictable processes as proof of time.
es: De la misma forma en que un secuestrador no puede pararse en frente del calendario que muestra la fecha actual, nosotros no podemos usar procesos predictibles como prueba del tiempo.

source: We always have to rely on something that can’t be predicted in advance, like the front page of today’s newspaper.
es: Siempre necesitamos apoyarnos en algo que no puede ser sabido con anterioridad, como la primera plana del diario de hoy.

source: Bitcoin relies upon two sources of unpredictability: transactions and proof-of-work.
es: Bitcoin se apoya en dos fuentes de impredecibilidad: transacciones y pruebas-de-trabajo.

source: Just like nobody can predict what tomorrow’s newspaper will look like, nobody can predict what the next Bitcoin block will look like.
es: De la misma forma en que nadie puede predecir cómo el diario de mañana se va a ver, nadie puede predecir cómo va a ser el siguiente bloque de Bitcoin.

source: You can’t predict what transactions are going to be included because you can’t predict what transactions are going to be broadcast in the future.
es: No puedes predecir qué transacciones van a ser incluidas porque no puedes predecir qué transacciones van a ser transmitidas en el futuro.

source: And, more importantly, you can’t predict who will find the solution to the current proof-of-work puzzle and what this solution will be.
es: Y, más importante, no puedes predecir quién va a encontrar la solución a la actual prueba-de-trabajo y cuál solución va a ser.

source: In contrast to the kidnapper’s newspaper, however, proof-of-work is physically linked to what happened directly.
es: A diferencia del periódico del secuestrador, sin embargo, la prueba de trabajo está vinculada físicamente a lo que pasó directamente.

source: It is not just a record of an event — it is the event itself.
es: No es sólo una grabación de un evento - es el evento en sí mismo.

source: It is the probabilistic directness of proof-of-work that removes trust from the equation.
es: Es la franqueza probabilística de la prueba de trabajo lo que remueve a la confianza de la ecuación.

source: The only way to find a valid proof-of-work is by making a lot of guesses, and making a single guess takes a little bit of time.
es: La única forma de encontrar una prueba de trabajo válida es intentar muchas veces adivinar algo, y adivinar lleva bastante tiempo.

source: The probabilistic sum of these guesses is what builds up the timechain that is Bitcoin.
es: La suma probabilística de estos intentos de adivinar es lo que construye la cadena de tiempo que es Bitcoin.

source: By utilizing the causality of hash-chains and the unpredictability of proof-of-work, the Bitcoin network provides a mechanism for establishing an indisputable history of events witnessed.
es: Al utilizar la causalidad de las cadenas de hash y la impredecibilidad de la prueba de trabajo, la red de Bitcoin provee un mecanismo para establecer un historial indiscutido de eventos verdaderos.

source: Without causality, what came before and what came after is impossible to tease apart.
es: Sin la causalidad, lo que vino antes y lo que vino después es imposible de distinguir.

source: Without unpredictability, causality is meaningless.
es: Sin impredecibilidad, la causalidad carece de sentido.

source: What is intuitively understood by every kidnapper was explicitly pointed out by Bayer, Haber, and Stornetta in 1992:
es: Lo que es intuitivamente entendido por cada secuestrador fue explícitamente señalado por Bayer, Haber y Stornetta en 1992:

source: “To establish that a document was created after a given moment in time, it is necessary to report events that could not have been predicted before they happened.”
es: “Para establecer que un documento fue creado después de un momento dado, es necesario reportar eventos que no podrían haberse predicho antes de que ocurrieran”.

source: Proof of Publication
es: Prueba de publicación

source: It is the combination of causality and unpredictability that allows the creation of an artificial “now” in the otherwise timeless digital realm.
es: La combinación de causalidad e impredecibilidad es lo que permite la creación de un “ahora” artificial en el ámbito digital, que de otro modo sería atemporal.

source: As Bayer, Haber, and Stornetta point out in their 1991 paper:
es: Como Bayer, Haber y Stornetta señalan en su paper de 1991:

source: “the sequence of clients requesting time-stamps and the hashes they submit cannot be known in advance.
es: “la secuencia de clientes requiriendo marcas de tiempo y los hash que ellos envían no pueden conocerse de antemano.

source: So if we include bits from the previous sequence of client requests in the signed certificate, then we know that the time-stamp occurred after these requests.
es: Por lo tanto, si en el certificado firmado incluimos bits de la secuencia anterior de solicitudes del cliente, entonces sabemos que la marca de tiempo ocurrió después de estas solicitudes.

source: But the requirement of including bits from previous documents in the certificate also can be used to solve the problem of constraining the time in the other direction, because the time-stamping company cannot issue later certificates unless it has the current request in hand.”
es: Pero el requisito de incluir bits de documentos previos en el certificado también puede ser usado para solucionar el problema de restringir el tiempo en la otra dirección, porque la empresa de sellado de tiempo no puede emitir certificados posteriores a menos que tenga la solicitud actual en su mano”.

source: All the puzzle pieces were already there.
es: Todas las piezas del rompecabezas ya estaban allí.

source: What Satoshi managed to do is put them together in a way that removes the “time-stamping company” from the equation.
es: Lo que Satoshi logró hacer fue ponerlas juntas de forma tal de remover de la ecuación a la “empresa de sellado de tiempo”.

source: The cause is hidden, but the result is known.
es: - La causa está oculta, pero el resultado es conocido.”

source: Ovid, Metamorphoses, IV. 287 (8 AD)
es: Ovid, Metamorphoses, IV. 287 (8 AC)

source: Let us recapitulate:
es: Recapitulemos:

source: to use money in the digital realm, we have to rely on ledgers.
es: para usar dinero en el ámbito digital, tenemos que confiar en los libros contables.

source: To make ledgers reliable, unambiguous order is required.
es: Para que estos libros sean confiables, se requiere un orden inequívoco.

source: To establish order, timestamps are necessary.
es: Para establecer orden, son necesarias las marcas de tiempo.

source: Thus, if we want to have trustless money in the digital realm, we must remove any entity that creates and manages timestamps and any single entity that is in charge of time itself.
es: Entonces, si queremos tener dinero sin confianza en el ámbito digital, debemos remover cualquier entidad que genere y maneje las marcas de tiempo y toda entidad que esté a cargo del tiempo en sí mismo.

source: It took a genius like Satoshi Nakamoto to realize the solution:
es: Se necesitó a un genio como Satoshi Nakamoto para encontrar la solución:

source: “To implement a distributed timestamp server on a peer-to-peer basis, we will need to use a proof-of-work system similar to Adam Back’s Hashcash.”
es: “Para implementar un servidor de marca de tiempo distribuido de par-a-par, necesitaremos utilizar un sistema de prueba de trabajo similar al Hashcash de Adam Back”.

source: We need to use a proof-of-work system because we need something that is native to the digital realm.
es: Tenemos que usar un sistema de prueba de trabajo porque necesitamos algo que sea nativo del ámbito digital.

source: Once you understand that the digital realm is informational in nature, the obvious conclusion is that computation is all we have.
es: Una vez que entiendas que el reino digital es de naturaleza informativa, la conclusión más obvia es que el cálculo es todo lo que tenemos.

source: If your world is made of data, manipulation of data is all there is.
es: Si tu mundo está hecho de datos, la manipulación de datos es todo lo que existe allí.

source: Proof-of-work works in a peer-to-peer setting because it is trustless, and it is trustless because it is disconnected from all external inputs — such as the readings of clocks (or newspapers, for that matter).
es: La prueba de trabajo funciona en un entorno de par-a-par porque no necesita de confianza, y no necesita de confianza porque está desconectado de todas las posibles entradas externas -como las lecturas de relojes (o periódicos, para el caso).

source: It relies on one thing and one thing only: computation requires work, and in our universe, work requires energy and time.
es: Recae en una sola cosa: el cálculo requiere trabajo, y en nuestro universo, el trabajo requiere energía y tiempo.

source: Bridging Times
es: Tiempos de transición

source: I know it works for me.
es: Sé que esto funciona para mí.

source: As we cross the bridge — the burning bridge — With flames behind us, We front the line.
es: Al cruzar el puente - el puente ardiente- Con llamas detrás nuestro, Estamos al frente de la línea.

source: It’s you and me, baby, against the world.
es: Somos tú y yo, cariño, contra el mundo.”

source: Kate Bush, Burning Bridge (1985)
es: - Kate Bush, Puente ardiente (1985)

source: Without proof-of-work, one would always run into the Oracle problem because the physical realm and the informational realm are eternally disconnected.
es: Sin prueba de trabajo, uno siempre correría dentro del problema del Oráculo, porque el ámbito físico y el informático están eternamente desconectados.

source: The markings on your list of sheep aren’t your sheep, the map is not the territory, and whatever was written in yesterday’s newspaper isn’t necessarily what happened in the real world.
es: Las marcas en tu lista de ovejas no son tus ovejas, el mapa no es el territorio, y lo que sea que haya sido escrito en el periódico de ayer no es necesariamente lo que ocurrió en el mundo real.

source: In the same manner, just because you use a real-world clock to write down a timestamp doesn’t mean that this is actually what the time was.
es: De la misma manera, el hecho de que uses un reloj del mundo real para escribir una marca de tiempo no significa que esta sea realmente la hora.

source: Put bluntly, there simply is no way to trust that data represents reality, except if the reality in question is inherent in the data itself.
es: Dicho de otra forma, simplemente no hay forma de confiar en que los datos representan la realidad, excepto si la realidad en cuestión es inherente a los datos en sí mismos.

source: The brilliant thing about Bitcoin’s difficulty-adjusted proof-of-work is that it creates its own reality, along with its own space and time.
es: Lo brillante de la prueba de trabajo de Bitcoin es que se ajusta por dificultad, al mismo tiempo que crea su propia realidad, junto con su propio tiempo y espacio.

source: Proof-of-work provides a direct connection between the digital realm and the physical realm.
es: La prueba de trabajo provee una conexión directa entre el ámbito digital y el físico.

source: More profoundly, it is the only connection that can be established in a trustless manner.
es: Dicho en mayor profundidad, es la única conexión que puede establecerse sin basarse en la confianza.

source: Everything else will always rely on external inputs.
es: Todo lo demás siempre va a depender de cosas externas.

source: The difficulty to mine a new Bitcoin block is adjusted to make sure that the thin thread between Bitcoin’s time and our time remains intact.
es: La dificultad de minar un nuevo bloque de Bitcoin está ajustada para asegurarse que el delgado hilo entre el tiempo de Bitcoin y el nuestro permanezca intacto.

source: Like clockwork, the mining difficulty readjusts every 2016 ticks.
es: Como un aparato de relojería, la dificultad de minería se reajusta cada 2016 ticks.

source: The goal of this readjustment is to keep the average time between ticks at ten minutes.
es: El objetivo de este reajuste es mantener un tiempo promedio entre ticks de diez minutos.

source: It is these ten minutes that maintain a stable connection between the physical and the informational realm.
es: Estos diez minutos son los que mantienen una conexión estable entre el ámbito físico y el informático.

source: Consequently, a sense of human time is required to readjust the ticks of the Bitcoin clock.
es: Consecuentemente, un sentido del tiempo humano es necesario para reajustar los ticks del reloj de Bitcoin.

source: A purely block-based readjustment wouldn’t work since it would be completely disconnected from our human world, and the whole purpose of the readjustment is to stop us ingenious humans from finding blocks too fast (or too slow).
es: Un reajuste puramente basado en los bloques no funcionará ya que estaría completamente desconectado de nuestro mundo humano, y el propósito final de este reajuste es impedir que nosotros, ingeniosos humanos, hallemos bloques demasiado rápido (o demasiado lento).

source: As Einstein has shown us, time is not a static thing.
es: Como Einstein nos demostró, el tiempo no es algo estático.

source: There is no such thing as a universal time we could rely upon.
es: No existe un tiempo universal en el cual podamos confiar.

source: Time is relative, and simultaneity is nonexistent.
es: El tiempo es relativo, y simultáneamente no existe.

source: This fact alone makes all timestamps — especially across large distances — inherently unreliable, even without adversarial actors.
es: Este hecho por sí solo hace que todas las marcas de tiempo -especialmente a lo largo de grandes distancias- sean intrínsecamente poco confiables, incluso sin factores adversos

source: (This is why timestamps of GPS satellites have to be adjusted constantly, by the way.)
es: (Por cierto, esta es la razón por la que las marcas de tiempo de los satélites GPS tienen que ajustarse constantemente).

source: For Bitcoin, the fact that our human timestamps are imprecise doesn’t matter too much.
es: Para Bitcoin, el hecho de que nuestras marcas de tiempo humanas sean imprecisas no importa demasiado.
